<!doctype html>
<html lang="ca">
<head>
<link rel="stylesheet" type="text/css" href="base.css" />
<link rel="stylesheet" type="text/css" href="content.css" />
<link rel="stylesheet" type="text/css" href="nav.css" />
<meta http-equiv="content-type" content="text/html;  charset=utf-8" />
<title>Amplificadors | Caracterització dels sistemes i senyals de telecomunicacions </title>
<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
<meta name="author" content="Gabriel Ramírez" />
<meta name="generator" content="eXeLearning 2.0.4 - exelearning.net" />
<!--[if lt IE 9]><script type="text/javascript" src="exe_html5.js"></script><![endif]-->
<script type="text/javascript" src="exe_jquery.js"></script>
<script type="text/javascript">$exe_i18n={show:"Mostra",hide:"Amaga",showFeedback:"Mostra realimentació",hideFeedback:"Amaga realimentació",correct:"Correcte",incorrect:"Incorrecte",menu:"Menú"}</script>
<script type="text/javascript" src="common.js"></script>
</head>
<body class="exe-web-site"><script type="text/javascript">document.body.className+=" js"</script>
<div id="content">
<p id="skipNav"><a href="#main" class="sr-av">Omet navegació</a></p>
<header id="header" >Caracterització dels sistemes i senyals de telecomunicacions</header>
<nav id="siteNav">
<ul>
   <li><a href="index.html" class="daddy main-node">Caracterització dels sistemes i senyals de telecomunicacions</a></li>
   <li><a href="introducci_a_les_telecomunicacions.html" class="no-ch">Introducció a les telecomunicacions</a></li>
   <li><a href="el_canal_de_comunicacions.html" class="no-ch">El canal de comunicacions.</a></li>
   <li><a href="arquitectura_dels_sistemes_de_comunicacions.html" class="no-ch">Arquitectura dels Sistemes de Comunicacions</a></li>
   <li><a href="senyals_indesitjables.html" class="no-ch">Senyals Indesitjables</a></li>
   <li><a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="no-ch">Classificació dels Sistemes de Telecomunicacions</a></li>
   <li><a href="limitacions_en_la_comunicaci_elctrica.html" class="no-ch">Limitacions en la comunicació elèctrica</a></li>
   <li><a href="la_relaci_senyal_a_soroll.html" class="no-ch">La relació senyal a soroll.</a></li>
   <li><a href="magnitudes_logaritmicas.html" class="no-ch">Magnitudes Logarítmicas</a></li>
   <li><a href="els_bits.html" class="no-ch">Els Bits</a></li>
   <li><a href="digitalitzaci_de_senyals.html" class="no-ch">Digitalització de senyals</a></li>
   <li id="active"><a href="amplificadors.html" class="active no-ch">Amplificadors</a></li>
   <li><a href="oscilladors.html" class="no-ch">Oscil·ladors</a></li>
   <li><a href="mescladors.html" class="no-ch">Mescladors</a></li>
   <li><a href="acopladores_de_impedancia.html" class="no-ch">Acopladores de Impedancia</a></li>
   <li><a href="modulacions.html" class="no-ch">Modulacions</a></li>
   <li><a href="anlisi_de_circuits.html" class="no-ch">Anàlisi de Circuits</a></li>
</ul>
</nav>
<div id='topPagination'>
<nav class="pagination noprt">
<a href="digitalitzaci_de_senyals.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="oscilladors.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
<div id="main-wrapper">
<section id="main">
<header id="nodeDecoration"><h1 id="nodeTitle">Amplificadors</h1></header>
<article class="iDevice_wrapper FreeTextIdevice" id="id128">
<div class="iDevice emphasis0">
<div id="ta128_1" class="block iDevice_content">
<h1 style="text-align: justify;">Amplificadors</h1>
<p style="text-align: justify;">Els amplificadors s&oacute;n indispensables en qualsevol sistema de comunicacions, igual que els filtres, els oscil&middot;ladors, els mescladors, etc. En el cas d'un transmisor la senyal d'entrada &eacute;s d'uns pocs miliwatts i cal que subministri a la antena un senyal de diversos Kw, &eacute;s evident que la senyal s'ha d'amplificar fins a aconseguir el nivell de pot&egrave;ncia de sortida requerit. En un receptor al qual l'antena lliura una senyal de l'ordre de picowatts (10-12 w), s'ha de produir una senyal de sortida amb pot&egrave;ncia suficient per excitar, per exemple a un altaveu, tamb&eacute; &eacute;s indispensable per tant amplificar el senyal diversos ordres de magnitud. En principi, els amplificadors han de complir la condici&oacute; de transmissi&oacute; sense distorsi&oacute;, almenys en la banda de pas d'inter&eacute;s i, per conseq&uuml;&egrave;ncia, han de ser lineals en el sentit que nom&eacute;s poden modificar l'amplitud del senyal sense canviar la seva forma d'ona. Aix&ograve; &uacute;ltim, en general, &eacute;s aplicable, si b&eacute; amb matisos, als sistemes anal&ograve;gics per&ograve; no necess&agrave;riament als sistemes digitals.</p>
<p style="text-align: justify;">La funci&oacute; principal de qualsevol amplificador &eacute;s augmentar el nivell de voltatge, corrent o pot&egrave;ncia d'una senyal d'entrada, convertint la pot&egrave;ncia subministrada per una font d'alimentaci&oacute; en pot&egrave;ncia &uacute;til de senyal a la sortida. La relaci&oacute; entre aquesta pot&egrave;ncia &uacute;til i la pot&egrave;ncia subministrada per la font es defineix com efici&egrave;ncia de l'amplificador. L'energia de la font no convertida en senyal util es perd en forma de calor i per aix&ograve;, cal extreure d'alguna manera la calor generada que, d'una altra manera, faria augmentar la temperatura dels components electr&ograve;nics de l'amplificador fins a destruir o danyar permanentment . Aquest &eacute;s un aspecte de gran import&agrave;ncia en el disseny de, pr&agrave;cticament, qualsevol circuit electr&ograve;nic.</p>
<h2 style="text-align: justify;">Classificaci&oacute; dels amplificadors</h2>
<p style="text-align: justify;">Els amplificadors poden classificar-se de diverses formes: la primera, segons el <strong>nivell de senyal amb el que treballen</strong>, en amplificadors de petita senyal o de senyal gran o gran senyal. Als primers tamb&eacute; se'ls designa com a amplificadors de voltatge i als segons, com de pot&egrave;ncia. Evidentment, aquesta designacion resulta ambigua i es complementa indicant si l'amplificador &eacute;s <strong>lineal o no lineal</strong>. Un amplificador lineal no distorsiona el senyal, almenys en teoria. Un amplificador no lineal pot o no distorsionar el senyal, depenent de la configuraci&oacute; del circuit que s'utilitzi. La distorsi&oacute; a la banda d'operaci&oacute; pot donar-se en amplitud, en fase o, m&eacute;s generalment, en ambdues. Tradicionalment es classifica als amplificadors en classes, les mes usuals, A, B i C. Intentarem aclarir aix&ograve; fent &uacute;s de la caracter&iacute;stica de transfer&egrave;ncia, que no s'ha de confondre aqu&iacute; amb la funci&oacute; de transfer&egrave;ncia.</p>
<p style="text-align: justify;">Una manera de definir la caracter&iacute;stica de transfer&egrave;ncia &eacute;s relacionant el voltatge, el corrent o la pot&egrave;ncia de sortida, amb el voltatge, corrent o pot&egrave;ncia d'entrada. Utilitzarem aqu&iacute; la pot&egrave;ncia i aix&iacute;, es pot representar aquesta relaci&oacute; mitjan&ccedil;ant la gr&agrave;fica de la figura seg&uuml;ent:</p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-08-24_a_les_16.40.47.png" /></p>
<p style="text-align: center;">Figura 1: Caracter&iacute;stica de transfer&egrave;ncia</p>
<p style="text-align: justify;"><br />En el cas m&eacute;s general, per senyals molt petites (regi&oacute; 1), la pot&egrave;ncia de sortida no &eacute;s directament proporcional a la d'entrada, la relaci&oacute; entre elles no &eacute;s lineal i la forma d'ona de la senyal de sortida no ser&agrave; exactament igual a la d'entrada. En molts dels dispositius amplificadors actuals aquesta regio &eacute;s molt petita i en la pr&agrave;ctica pot ignorar si no &eacute;s significativa. D'altra banda la regi&oacute; 3, a la dreta, tampoc &eacute;s lineal i s'aconsegueix quan el dispositiu amplificador no &eacute;s capa&ccedil; de subministrar m&eacute;s pot&egrave;ncia de sortida per molt que augmenti la pot&egrave;ncia de la senyal d'entrada. Quan el nivell de pot&egrave;ncia de sortida es desvia 1dB (0,7943 en escala lineal) per sota del que hauria de tenir si la caracter&iacute;stica fos lineal, es designa com a punt de compressi&oacute; i es considera com el punt a partir del qual la distorsi&oacute; de la senyal de sortida respecte a la d'entrada comen&ccedil;a a ser apreciable. La regi&oacute; 2, interm&egrave;dia, &eacute;s la regi&oacute; lineal.</p>
<h3 style="text-align: justify;">Funcionament en classe A</h3>
<p style="text-align: justify;">En un amplificador funcionant en classe A, hi ha senyal de sortida durant tot el cicle de la senyal d'entrada, &eacute;s a dir, el dispositiu amplificador condueix durant 360 graus el&egrave;ctrics. Aix&ograve; es mostra a la figura 2, on en l'eix vertical s'il&middot;lustra el senyal d'entrada i en l'horitzontal la de sortida. Es suposa, per a aquest exemple que l'amplificador no &eacute;s inversor, &eacute;s a dir, els senyals d'entrada i sortida estan en fase.</p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-08-24_a_les_16.43.43.png" /><br />Figura 2: Funcionament en classe A</p>
<p style="text-align: justify;">En general, en classe A es procura que el dispositiu operi a la regi&oacute; lineal, prou lluny dels punts de tall i saturaci&oacute; com per evitar la distorsi&oacute;. L'amplificaci&oacute; en classe A proporciona la m&agrave;xima linealitat i guany, per&ograve; la seva efici&egrave;ncia &eacute;s baixa. En teoria l'efici&egrave;ncia m&agrave;xima pot arribar al 50%. A la pr&agrave;ctica, l'usual &eacute;s que sigui de l'ordre del 20% o fins i tot menor.</p>
<h3 style="text-align: justify;">Funcionament en classe AB</h3>
<p style="text-align: justify;">El angle de conducci&oacute;, en aquest cas &eacute;s major de 180o i menor de 360, com es mostra a la figura 3. Aix&ograve; vol dir que el punt de polaritzaci&oacute;, Q, del dispositiu actiu de l'amplificador s'ajusta de manera que el corrent no flueixi durant tot el cicle, per&ograve; si durant m&eacute;s de la meitat d'aquest.<br />&Eacute;s clar que la senyal de sortida est&agrave; distorsionada. No obstant aix&ograve; es poden aconseguir amplificadors lineals en classe AB amb circuits configurats de manera simetrica o en push-pull, en qu&egrave; s'utilitzen dos dispositius connectats en aquesta configuraci&oacute;. Aix&ograve; obliga que s'han de subministrar 2 senyals a l'entrada del amplificador push-pull, de fet, la mateixa senyal, defasada 180 a cada amplificador.</p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-08-24_a_les_16.47.58.png" width="402" height="360" /></p>
<p style="text-align: center;"><span>Figura 3: Funcionament en classe AB</span></p>
<p style="text-align: justify;">L'efici&egrave;ncia dels amplificadors classe AB pot arribar en la pr&agrave;ctica a valors de l'ordre de 60%, el que &eacute;s considerablement major que en el cas del classe A.</p>
<h3 style="text-align: justify;">Funcionament en classe B</h3>
<p style="text-align: justify;">En els amplificadors classe B, l'angle de conducci&oacute; &eacute;s exactament igual a 180 graus el&egrave;ctrics, el que significa que el dispositiu actiu d'amplificaci&oacute; est&agrave; polaritzat al seu voltatge de tall. El corrent de sortida flueix nom&eacute;s durant mig cicle de la senyal d'entrada. En aquestes condicions, es poden aconseguir a la pr&agrave;ctica, efici&egrave;ncies fins d'un 65%. Aquest tipus d'amplificadors s'empra extensament en els amplificadors sintonitzats de pot&egrave;ncia en transmissors. A la figura 4 s'il&middot;lustra la forma de conducci&oacute; en els amplificadors classe B. La senyal de sortida d'un amplificador classe B on la c&agrave;rrega fora purament resistiva, &eacute;s similar a la que es t&eacute; en un rectificador de mitja ona.</p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-08-24_a_les_16.56.08.png" />￼</p>
<p style="text-align: center;">Figura 4: Funcionament en classe B.</p>
<h3>Funcionament en classe C</h3>
<p style="text-align: justify;">En el funcionament a classe C, el punt de polaritzaci&oacute; o funcionament aquesta m&eacute;s enll&agrave; del punt de tall del dispositiu, de manera que aquest condueix durant menys de mig cicle (&lt;180 &ordm;).</p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-08-24_a_les_16.57.48.png" /><br />￼￼Figura 5: Funcionament en classe C</p>
<h3>Altres classes d'amplificadors</h3>
<p style="text-align: justify;">A m&eacute;s de les classes anteriors, hi ha amplificadors treballen en forma commutada i que es classifiquen en classes D a H que no es tracten aqu&iacute;. La seva caracter&iacute;stica principal &eacute;s l'elevada efici&egrave;ncia que s'aconsegueix i troben nombroses aplicacions en circuits d'&agrave;udio i RF per reduir els requisits de les fonts d'alimentaci&oacute; i reduir la dissipaci&oacute; t&egrave;rmica. En general, aquestes classes d'amplificadors requereixen dissenys relativament sofisticats, especialment a nivells alts de pot&egrave;ncia.</p>
<p style="text-align: justify;">La classe de funcionament d'un amplificador &eacute;s independent del dispositiu actiu utilitzat. Com pot inferir de la discussi&oacute; anterior, la classe de funcionament est&agrave; determinada pel punt d'operaci&oacute; del dispositiu i les caracter&iacute;stiques de la senyal.</p>
<p style="text-align: justify;">Si b&eacute; l'an&agrave;lisi d'un circuit amplificador pot considerar relativament simple, el seu disseny pot resultar complex en intervenir altres consideracions com les seg&uuml;ents:</p>
<ul>
<li style="text-align: justify;">Guany de voltatge, corrent i pot&egrave;ncia.</li>
<li style="text-align: justify;">Imped&agrave;ncia d'entrada.</li>
<li style="text-align: justify;">Imped&agrave;ncia de sortida.</li>
<li style="text-align: justify;">Resposta en freq&uuml;&egrave;ncia</li>
<li style="text-align: justify;">Requisits d'alimentaci&oacute;.</li>
<li style="text-align: justify;">dissipaci&oacute; t&egrave;rmica.</li>
<li style="text-align: justify;">Fiabilitat.</li>
<li style="text-align: justify;">Altres factors, com caracter&iacute;stiques mec&agrave;niques, etc.</li>
</ul>
<p style="text-align: justify;">&nbsp;</p>
</div>
</div>
</article>
</section>
</div>
<div id='bottomPagination'>
<nav class="pagination noprt">
<a href="digitalitzaci_de_senyals.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="oscilladors.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
</div>
</body></html>