<!doctype html>
<html lang="ca">
<head>
<link rel="stylesheet" type="text/css" href="base.css" />
<link rel="stylesheet" type="text/css" href="content.css" />
<link rel="stylesheet" type="text/css" href="nav.css" />
<meta http-equiv="content-type" content="text/html;  charset=utf-8" />
<title>Introducció a les telecomunicacions | Caracterització dels sistemes i senyals de telecomunicacions </title>
<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
<meta name="author" content="Gabriel Ramírez" />
<meta name="generator" content="eXeLearning 2.0.4 - exelearning.net" />
<!--[if lt IE 9]><script type="text/javascript" src="exe_html5.js"></script><![endif]-->
<script type="text/javascript" src="exe_jquery.js"></script>
<script type="text/javascript">$exe_i18n={show:"Mostra",hide:"Amaga",showFeedback:"Mostra realimentació",hideFeedback:"Amaga realimentació",correct:"Correcte",incorrect:"Incorrecte",menu:"Menú"}</script>
<script type="text/javascript" src="common.js"></script>
</head>
<body class="exe-web-site"><script type="text/javascript">document.body.className+=" js"</script>
<div id="content">
<p id="skipNav"><a href="#main" class="sr-av">Omet navegació</a></p>
<header id="header" >Caracterització dels sistemes i senyals de telecomunicacions</header>
<nav id="siteNav">
<ul>
   <li><a href="../../index.html" class="daddy main-node">INICI</a></li>
   <li><a href="../index.html" class="daddy main-node">M08-Sistemes de Telecomunicacions</a></li>
   <li><a href="index.html" class="daddy main-node">Caracterització dels sistemes i senyals de telecomunicacions</a></li>
   <li id="active"><a href="introducci_a_les_telecomunicacions.html" class="active no-ch">Introducció a les telecomunicacions</a></li>
   <li><a href="el_canal_de_comunicacions.html" class="no-ch">El canal de comunicacions.</a></li>
   <li><a href="arquitectura_dels_sistemes_de_comunicacions.html" class="no-ch">Arquitectura dels Sistemes de Comunicacions</a></li>
   <li><a href="senyals_indesitjables.html" class="no-ch">Senyals Indesitjables</a></li>
   <li><a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="no-ch">Classificació dels Sistemes de Telecomunicacions</a></li>
   <li><a href="limitacions_en_la_comunicaci_elctrica.html" class="no-ch">Limitacions en la comunicació elèctrica</a></li>
   <li><a href="la_relaci_senyal_a_soroll.html" class="no-ch">La relació senyal a soroll.</a></li>
   <li><a href="magnitudes_logaritmicas.html" class="no-ch">Magnitudes Logarítmicas</a></li>
   <li><a href="els_bits.html" class="no-ch">Els Bits</a></li>
   <li><a href="digitalitzaci_de_senyals.html" class="no-ch">Digitalització de senyals</a></li>
   <li><a href="amplificadors.html" class="no-ch">Amplificadors</a></li>
   <li><a href="oscilladors.html" class="no-ch">Oscil·ladors</a></li>
   <li><a href="mescladors.html" class="no-ch">Mescladors</a></li>
   <li><a href="acopladores_de_impedancia.html" class="no-ch">Acopladores de Impedancia</a></li>
   <li><a href="modulacions.html" class="no-ch">Modulacions</a></li>
   <li><a href="anlisi_de_circuits.html" class="no-ch">Anàlisi de Circuits</a></li>
</ul>
</nav>
<div id='topPagination'>
<nav class="pagination noprt">
<a href="index.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="el_canal_de_comunicacions.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
<div id="main-wrapper">
<section id="main">
<header id="nodeDecoration"><h1 id="nodeTitle">Introducció a les telecomunicacions</h1></header>
<article class="iDevice_wrapper FreeTextIdevice" id="id103">
<div class="iDevice emphasis0">
<div id="ta103_1" class="block iDevice_content">
<h1 style="text-align: justify;">Comunicacions</h1>
<p style="text-align: justify;">El concepte de comunicaci&oacute; no &eacute;s f&agrave;cil de definir i sovint s'assumeix que tots tenim intu&iuml;tivament la idea del que &eacute;s. Per a les persones i animals, es pot definir com l'intercanvi d'informaci&oacute; entre individus mitjan&ccedil;ant un sistema com&uacute; de s&iacute;mbols, b&eacute; sigui mitjan&ccedil;ant llenguatge, signes o gestos. La definici&oacute; anterior pot estendre tamb&eacute; a la comunicaci&oacute; entre m&agrave;quines, en aquest cas els s&iacute;mbols que representen la informaci&oacute; han de reunir caracter&iacute;stiques especials. La enginyeria de telecomunicaci&oacute; o enginyeria de comunicacions &eacute;s la branca de l'enginyeria que s'ocupa de la generaci&oacute;, transmissi&oacute;, recepci&oacute; i processat de senyals ja sigui per mitjans el&egrave;ctrics, elctromagneticos, electroac&uacute;stics, &ograve;ptics, etc., I els sistemes de telecomunicaci&oacute; s&oacute;n aquells que mitjan&ccedil;ant l'&uacute;s de t&egrave;cniques i dispositius adequats realitzen el transport d'informaci&oacute; entre una font i un o m&eacute;s destinataris finals.</p>
<p style="text-align: justify;">&nbsp;</p>
<h2 style="text-align: justify;">Informaci&oacute;&nbsp;</h2>
<p style="text-align: justify;">Encara que tamb&eacute; intu&iuml;tivament es t&eacute; el concepte d'informaci&oacute;, el significat pot ser molt diferent segons el context en qu&egrave; es manegi. Aix&iacute;, per a una bona quantitat de gent el terme s'associa generalment amb el camp period&iacute;stic, radiof&ograve;nic o televisiu. De fet, en nombroses institucions es cursen carreres designades com Ci&egrave;ncies de la Comunicaci&oacute; o Ci&egrave;ncies i Tecniques de la Informaci&oacute; que poc o res tenen a veure amb la ci&egrave;ncia o l'enginyeria de comunicacions. No &eacute;s estrany, per tant, que Jurgen Ruesch hagi identificat 40 varietats dels enfocaments interdisplinaris per al tema, incloent t&ograve;pics tan variats com els aspectes informals de la comunicaci&oacute;, impl&iacute;cits en l'atracci&oacute; sexual o en el comportament davant el joc i identificant almenys 50 modes de comunicaci&oacute; interpersonal. Entre els aspectes d'import&agrave;ncia tractats en aquest context cal esmentar la import&agrave;ncia que es d&oacute;na en els mitjans massius de comunicaci&oacute; (r&agrave;dio, televisi&oacute;, premsa i actualment Internet) a l'efecte dels missatges sobre l'audi&egrave;ncia i l'estudi de t&egrave;cniques de persuasi&oacute; per tal d'influir en la disposici&oacute; dels individus cap a la modificaci&oacute; d'h&agrave;bits de consum, simpatia pol&iacute;tica o creences religioses entre d'altres. Amb excepci&oacute; de la premsa escrita, els sistemes de comunicacions transporten informaci&oacute; per aquests i altres fins. En aquest cas es pot dir que el t&egrave;cnic de telecomunicaci&oacute; s'ocupa de dissenyar, instal&middot;lar i mantenir el vehicle, per&ograve; no t&eacute; cap influ&egrave;ncia sobre el que dit vehicle transporta, &eacute;s a dir, el contingut. En alguns casos, el t&egrave;cnic de telecomunicaci&oacute; s'ha d'ocupar tamb&eacute; del contingut, per exemple en alguns sistemes de comunicaci&oacute; entre m&agrave;quines.</p>
<p style="text-align: justify;">Donada la varietat d'interpretacions que es poden donar al terme informaci&oacute;, conv&eacute; definir amb una mica m&eacute;s de precisi&oacute; per als fins i objectius d'un curs de sistemes de comunicacions. Aix&iacute;, per informaci&oacute; s'ent&eacute;n aqu&iacute; el <strong>conjunt de senyals, produ&iuml;des per fen&ograve;mens f&iacute;sics, registrats, classificats, organitzats i relacionats, amb un significat prec&iacute;s per a un destinatari espec&iacute;fic</strong>.</p>
<p style="text-align: justify;">Amb freq&uuml;&egrave;ncia es parla tamb&eacute; d'<strong>elements d'informaci&oacute;</strong>. En una comunicaci&oacute; de veu la informaci&oacute; flueix de manera cont&iacute;nua entre el transmissor i el receptor. Els elements d'informaci&oacute; s&oacute;n en aquest cas els augments infinitesimalment petits entre dos instants, tamb&eacute; infinitesimalment petits, de la pressi&oacute; de l'aire produ&iuml;da per les cordes vocals del locutor o sobre el timp&agrave; de l'oient. En aquestes condicions la informaci&oacute; d&oacute;na lloc a una senyal cont&iacute;nua en el temps, o senyal anal&ograve;gica i els elements d'informaci&oacute; poden associar-se amb elements sil&middot;l&agrave;bics de la veu, per&ograve; en el cas de musica aquesta associaci&oacute; resulta m&eacute;s dificil. En els sistemes digitals, per altra banda, els elements d'informaci&oacute; s&oacute;n discrets i f&agrave;cils d'identificar. Un exemple simple d'un sistema digital de comunicacions &eacute;s la telegrafia i &eacute;s interessant notar que aquest va ser anterior a la telefonia en diverses decades. En telegrafia els elements d'informaci&oacute; s&oacute;n polsos de curta i llarga durada (punts i ratlles) que, combinats de diverses formes representen de manera discreta els car&agrave;cters alfab&egrave;tics i num&egrave;rics, aix&iacute; com alguns simbols ortogr&agrave;fics i de control en la forma que s'il&middot;lustra a la Taula 1.1.</p>
<p style="text-align: justify;"><img src="Captura_de_pantalla_2013-08-19_a_les_11.02.46.png" alt="morse" style="display: block; margin-left: auto; margin-right: auto;" /></p>
<p style="text-align: justify;"><br />El conjunt de diversos elements d'informaci&oacute; constitueix un simbol i, al seu torn, el conjunt de diversos s&iacute;mbols constitueix un missatge. L'alfabet Morse, utilitzat des de fa mes de 150 anys, no &eacute;s mes que una de les moltes formes possibles de codificar els car&agrave;cters alfab&egrave;tics mitjan&ccedil;ant elements discrets. En termes molt simples, es pot dir que un missatge est&agrave; compost per elements d'informaci&oacute; i que aquesta pot fluir de forma cont&iacute;nua o discreta entre el transmissor i el receptor. Aix&iacute; mateix, un missatge &eacute;s una cosa que el receptor o el destinatari de la informaci&oacute; ent&eacute;n i que, en general no coneixia pr&egrave;viament. Aquesta &eacute;s una de les caracter&iacute;stiques fonamentals de la informaci&oacute;, &eacute;s a dir, el desconeixement previ del seu contingut o, expressat en termes m&eacute;s t&egrave;cnics, la seva <strong>aleatorietat</strong>. Un missatge cont&eacute; m&eacute;s informaci&oacute; quant mes impredictible sigui aquesta. Una cosa que es coneix per endavant, en realitat cont&eacute; molt poca o cap informaci&oacute;.</p>
<p style="text-align: justify;">&nbsp;</p>
<h2 style="text-align: justify;">Senyals</h2>
<p style="text-align: justify;">Aix&iacute; mateix, per senyal s'ent&eacute;n la <strong>representaci&oacute; d'una magnitud f&iacute;sica, detectable, variable en el temps, l'espai o tots dos, a la qual es pot assignar un determinat significat o contingut d'informaci&oacute;</strong>. Aqui, el terme senyal es refereix a senyals el&egrave;ctriques, encara que en la seva forma original siguin d'una altra naturalesa, per exemple, ac&uacute;stiques, mec&agrave;niques, &ograve;ptiques, etc., Que, en general, poden convertir-se a senyals el&egrave;ctriques mitjan&ccedil;ant transductors adequats.</p>
<p style="text-align: justify;">Les senyals poden caracteritzar-se en el domini del temps o en el de freq&uuml;&egrave;ncia. Les dues caracteritzacions representen el mateix fenomen. En els sistemes de tele-comunicaci&oacute; &eacute;s usual la <strong>representaci&oacute; en el domini de freq&uuml;&egrave;ncia</strong>, ja que aquesta proporciona informaci&oacute; sobre l'<strong>ample de banda</strong> en qu&egrave; est&agrave; continguda l'energia de la senyal. En general, quan aqu&iacute; es parla del domini de freq&uuml;&egrave;ncia, s'ent&eacute;n pel la transformada de Fourier de la funci&oacute; que descriu a la senyal en el domini del temps. En algunes aplicacions, principalment de processament de senyals s'empren altres transformacions com les del cosinus discret, la d'Hilbert, Haddamard, etc. A causa que la transformada de Fourier &eacute;s complexa, la representaci&oacute; completa de la senyal en el domini de freq&uuml;&egrave;ncia s'ha de fer en termes d'amplitud i de fase, si b&eacute; en la major part dels casos pr&agrave;ctics, &eacute;s suficient la representaci&oacute; de l'espectre d'amplitud. L'aparell utilitzat per aix&ograve; es denomina analitzador d'espectre. A la figura 1.1 es mostra una senyal de televisi&oacute; de color en el domini del temps, com es veuria en un oscil &middot; loscopi i en el de freq&uuml;&egrave;ncia, com es veuria en un analitzador d'espectre.</p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-08-19_a_les_11.08.01.png" width="696" height="287" alt="Barras" /></p>
<p style="text-align: justify;">Les senyals generades per una font d'informaci&oacute; i convertides a senyals el&egrave;ctriques, com ara la veu o una imatge s&oacute;n senyals de pas baix i sovint es designen tamb&eacute; com senyals en banda base. No obstant aix&ograve; les senyals en banda base en els sistemes de comunicacions tenen un significat m&eacute;s ampli, ja que poden estar constitu&iuml;des per combinacions de senyals de pas baix. Tal &eacute;s el cas de la telefonia multicanal en qu&egrave; el senyal en banda base multicanal pot estar formada per centenars de senyals de veu. La senyal en banda base de television cont&eacute; almenys tres senyals: v&iacute;deo monocromatico o lumin&agrave;ncia, color i so. Aqui <strong>s'ent&eacute;n per senyal en banda base aquella que s'aplica a l'entrada del modulador d'un transmissor</strong>.</p>
<p style="text-align: justify;">&nbsp;</p>
<h2 style="text-align: justify;">Transmissi&oacute; en banda base</h2>
<p style="text-align: justify;">Quan es t&eacute; m&eacute;s d'una senyal en banda base, per exemple senyals de veu, no poden transmetre simult&agrave;niament per un mateix canal de comunicaci&oacute; utilitzant el mateix espectre de freq&uuml;&egrave;ncia, llevat que se les separi d'alguna manera, ja que de no fer-ho interferirien m&uacute;tuament i el receptor seria incapa&ccedil; de discernir cada senyal individual. Aquesta situaci&oacute; s'aprecia clarament quan diverses persones parlen alhora, en el mateix espai i amb el mateix nivell de veu. El mateix passaria si diverses persones utilitzen simult&agrave;niament una mateixa l&iacute;nia telef&ograve;nica. D'aix&ograve; s'infereix que <strong>si la transmissi&oacute; es realitza en banda base, es requereixen tants canals de comunicaci&oacute; independents com senyals hagi</strong>.</p>
</div>
</div>
</article>
</section>
</div>
<div id='bottomPagination'>
<nav class="pagination noprt">
<a href="index.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="el_canal_de_comunicacions.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
</div>
</body></html>