<!doctype html>
<html lang="ca">
<head>
<link rel="stylesheet" type="text/css" href="base.css" />
<link rel="stylesheet" type="text/css" href="content.css" />
<link rel="stylesheet" type="text/css" href="nav.css" />
<meta http-equiv="content-type" content="text/html;  charset=utf-8" />
<title>Limitacions en la comunicació elèctrica | Caracterització dels sistemes i senyals de telecomunicacions </title>
<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
<meta name="author" content="Gabriel Ramírez" />
<meta name="generator" content="eXeLearning 2.0.4 - exelearning.net" />
<!--[if lt IE 9]><script type="text/javascript" src="exe_html5.js"></script><![endif]-->
<script type="text/javascript" src="exe_jquery.js"></script>
<script type="text/javascript">$exe_i18n={show:"Mostra",hide:"Amaga",showFeedback:"Mostra realimentació",hideFeedback:"Amaga realimentació",correct:"Correcte",incorrect:"Incorrecte",menu:"Menú"}</script>
<script type="text/javascript" src="common.js"></script>
</head>
<body class="exe-web-site"><script type="text/javascript">document.body.className+=" js"</script>
<div id="content">
<p id="skipNav"><a href="#main" class="sr-av">Omet navegació</a></p>
<header id="header" >Caracterització dels sistemes i senyals de telecomunicacions</header>
<nav id="siteNav">
<ul>
   <li><a href="index.html" class="daddy main-node">Caracterització dels sistemes i senyals de telecomunicacions</a></li>
   <li><a href="introducci_a_les_telecomunicacions.html" class="no-ch">Introducció a les telecomunicacions</a></li>
   <li><a href="el_canal_de_comunicacions.html" class="no-ch">El canal de comunicacions.</a></li>
   <li><a href="arquitectura_dels_sistemes_de_comunicacions.html" class="no-ch">Arquitectura dels Sistemes de Comunicacions</a></li>
   <li><a href="senyals_indesitjables.html" class="no-ch">Senyals Indesitjables</a></li>
   <li><a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="no-ch">Classificació dels Sistemes de Telecomunicacions</a></li>
   <li id="active"><a href="limitacions_en_la_comunicaci_elctrica.html" class="active no-ch">Limitacions en la comunicació elèctrica</a></li>
   <li><a href="la_relaci_senyal_a_soroll.html" class="no-ch">La relació senyal a soroll.</a></li>
   <li><a href="magnitudes_logaritmicas.html" class="no-ch">Magnitudes Logarítmicas</a></li>
   <li><a href="els_bits.html" class="no-ch">Els Bits</a></li>
   <li><a href="digitalitzaci_de_senyals.html" class="no-ch">Digitalització de senyals</a></li>
   <li><a href="amplificadors.html" class="no-ch">Amplificadors</a></li>
   <li><a href="oscilladors.html" class="no-ch">Oscil·ladors</a></li>
   <li><a href="mescladors.html" class="no-ch">Mescladors</a></li>
   <li><a href="acopladores_de_impedancia.html" class="no-ch">Acopladores de Impedancia</a></li>
   <li><a href="modulacions.html" class="no-ch">Modulacions</a></li>
   <li><a href="anlisi_de_circuits.html" class="no-ch">Anàlisi de Circuits</a></li>
</ul>
</nav>
<div id='topPagination'>
<nav class="pagination noprt">
<a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="la_relaci_senyal_a_soroll.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
<div id="main-wrapper">
<section id="main">
<header id="nodeDecoration"><h1 id="nodeTitle">Limitacions en la comunicació elèctrica</h1></header>
<article class="iDevice_wrapper FreeTextIdevice" id="id111">
<div class="iDevice emphasis0">
<div id="ta111_1" class="block iDevice_content">
<h1 style="text-align: justify;">Limitacions fonamentals en la comunicacio electrica.</h1>
<p style="text-align: justify;">En el disseny d'un sistema de comunicaci&oacute; o de qualsevol sistema, el t&egrave;cnic es col&middot;loca davant de dos classes generals de restriccions: per una banda, els <strong>factors tecnol&ograve;gics</strong>, &eacute;s a dir, els factors vitals de l'enginyeria i de l'altra, les <strong>limitacions f&iacute;siques</strong> fonamentals imposades pel propi sistema, es a dir, les lleis de la natura en relaci&oacute; amb l'objectiu proposat.</p>
<p style="text-align: justify;">Ja que l'enginyeria &eacute;s, o ha de ser, l'art del possible, les dues classes de restriccions han de ser analitzades en dissenyar el sistema. Hi ha m&eacute;s d'una difer&egrave;ncia, ja que els problemes tecnologics s&oacute;n problemes de practibilitat que inclouen consideracions tan diverses com disponibilitat de l'equip, interacci&oacute; amb sistemes existents, factors econ&ograve;mics, etc., Problemes que poden ser resolts en teoria, encara que no sempre de manera pr&agrave;ctica. Per&ograve; les limitacions f&iacute;siques fonamentals s&oacute;n justament aix&ograve;, quan apareixen en primer pla, no hi ha recursos, fins i tot en teoria. No obstant aix&ograve;, els problemes tecnol&ograve;gics s&oacute;n les limitacions que en &uacute;ltima inst&agrave;ncia assenyalen si poden o no ser salvades. Les limitacions fonamentals en la transmissi&oacute; de la informaci&oacute; per mitjans el&egrave;ctrics s&oacute;n l'ample de banda i el soroll.</p>
<h2 style="text-align: justify;">La limitaci&oacute; de l'ample de banda.</h2>
<p style="text-align: justify;">La utilitzaci&oacute; de sistemes eficients condueix a una reducci&oacute; del temps de transmissi&oacute;, &eacute;s a dir, que exerceix m&eacute;s informaci&oacute; en el menor temps. Una transmissi&oacute; d'informaci&oacute; r&agrave;pida s'aconsegueix emprant senyals que varien r&agrave;pidament amb el temps. Per&ograve; estem tractant amb un sistema el&egrave;ctric, el qual compta amb energia emmagatzemada, i hi ha una llei f&iacute;sica ben coneguda que expressa que en tots els sistemes, excepte en els que no hi ha perdudes, un canvi en l'energia emmagatzemada requereix una quantitat definida de temps . Aix&iacute;, no podem incrementar la velocitat de la senyalitzaci&oacute; en forma arbitr&agrave;ria, ja que en conseq&uuml;&egrave;ncia el sistema deix&eacute;s de respondre als canvis de la senyal.</p>
<p style="text-align: justify;">Una mesura convenient de la velocitat de la senyal &eacute;s el seu ample de banda, o sigui, l'ample de l'espectre de la senyal. En forma similar, el r&egrave;gim al qual pot un sistema canviar energia emmagatzemada, es reflecteix en la seva resposta de freq&uuml;&egrave;ncia util, mesura en termes de l'ample de banda del sistema. La transmissi&oacute; d'una gran quantitat d'informaci&oacute; en una petita quantitat de temps, requereix senyals de banda ampla per a representar la informaci&oacute; i sistemes de banda ampla per acomodar les senyals. Per tant, l'ample de banda sorgeix com una limitaci&oacute; fonamental.</p>
<p style="text-align: justify;">Quan es requereix d'una transmissi&oacute; en temps real, el disseny ha d'assegurar un adequat ample de banda del sistema. Si l'ample de banda &eacute;s insuficient, pot ser necessari disminuir la velocitat de senyalitzaci&oacute;, incrementant aix&iacute; el temps de transmissi&oacute;.</p>
<h2 style="text-align: justify;">La limitaci&oacute; soroll</h2>
<p style="text-align: justify;">L'&egrave;xit en la comunicaci&oacute; el&egrave;ctrica dep&egrave;n de l'exactitud amb qu&egrave; el receptor pugui determinar quina senyal &eacute;s la que va ser realment transmesa, diferenciant-la de les senyals que podrien haver estat transmeses. Una identificaci&oacute; perfecta de la senyal seria possible nom&eacute;s en abs&egrave;ncia de soroll i altres contaminacions, per&ograve; el soroll existeix sempre en els sistemes el&egrave;ctrics i les seves pertorbacions sobreposades limiten la nostra habilitat per identificar correctament el senyal que ens interessa i aix&iacute;, la transmissi&oacute; de la informaci&oacute;.</p>
<p style="text-align: justify;">Per&ograve; perqu&egrave; &eacute;s inevitable el soroll? La&nbsp;resposta prov&eacute; de la teoria cinetica. Qualsevol part&iacute;cula a una&nbsp;temperatura diferent de zero absolut, posseeix una energia termica&nbsp;que es manifesta com a moviment aleatori o agitaci&oacute; termica. Si&nbsp;la part&iacute;cula &eacute;s un electron, el seu moviment aleatori origina una&nbsp;corrent aleat&ograve;ria. Despr&eacute;s, si aquest corrent aleat&ograve;ria passa en un&nbsp;medi conductor, es produeix un voltatge aleatori conegut com a soroll&nbsp;t&egrave;rmic o soroll de resist&egrave;ncia. El soroll de resist&egrave;ncia &eacute;s&nbsp;nom&eacute;s una de les possibles fonts de soroll en un sistema, per&ograve; moltes altres fonts estan tamb&eacute; relacionades, en una o altra forma, amb el moviment electr&ograve;nic&nbsp;aleatori. M&eacute;s encara, com era d'esperar-se de la dualitat ona-part&iacute;cula, hi ha soroll t&egrave;rmic associat amb la radiaci&oacute;&nbsp;electromagnetica. En conseq&uuml;&egrave;ncia, com no podem tenir comunicaci&oacute; el&egrave;ctrica sense electrons o ones electromagn&egrave;tiques, tampoc podem tenir comunicaci&oacute; el&egrave;ctrica sense soroll.</p>
<p style="text-align: justify;">Les variacions de soroll t&iacute;piques s&oacute;n molt petites, de l'ordre dels microvolts. Si les variacions de la senyal s&oacute;n substancialment majors, diguem diversos volts pic a pic, el soroll pot ser ignorat. En realitat, en sistemes ordinaris sota condicions ordin&agrave;ries, la relaci&oacute; senyal a soroll ha de ser bastant gran perqu&egrave; el soroll no sigui perceptible. Per&ograve; en sistemes d'ampli r&egrave;gim o de pot&egrave;ncia m&iacute;nima, la senyal rebuda pot ser tan petita com el soroll o mes. Quan aix&ograve; succeeixi, la limitaci&oacute; per soroll resulta molt real.</p>
<p style="text-align: justify;">&Eacute;s important assenyalar que si la intensitat de la senyal &eacute;s insuficient, afegir m&eacute;s passos d'amplificaci&oacute; en el receptor no resol res, el soroll seria amplificat juntament amb el senyal, cosa que no millora la relaci&oacute; senyal a soroll (SNR). Augmentar la pot&egrave;ncia transmesa ajuda, per&ograve; la pot&egrave;ncia no es pot incrementar en forma indefinida per ra&oacute; de problemes tecnol&ograve;gics. En forma alterna, com s'esmenta al principi, podem permutar l'ample de banda per la relaci&oacute; senyal a soroll per mitj&agrave; de t&egrave;cniques de modulaci&oacute; i codificaci&oacute;. No ha de sorprendre que la mes efectiva d'aquestes t&egrave;cniques generalment sigui la mes costosa i dif&iacute;cil d'instrumentar. Noteu tamb&eacute; que el canvi de l'ample de banda per la relacio senyal a soroll pot portar d'una limitaci&oacute; a una altra.</p>
<p style="text-align: justify;">El disseny del sistema de comunicaci&oacute; &eacute;s un assumpte de comprom&iacute;s, un comprom&iacute;s entre temps de transmissi&oacute;, pot&egrave;ncia transmesa, ample de banda i relaci&oacute; senyal a soroll.</p>
</div>
</div>
</article>
</section>
</div>
<div id='bottomPagination'>
<nav class="pagination noprt">
<a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="la_relaci_senyal_a_soroll.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
</div>
</body></html>