<!doctype html>
<html lang="ca">
<head>
<link rel="stylesheet" type="text/css" href="base.css" />
<link rel="stylesheet" type="text/css" href="content.css" />
<link rel="stylesheet" type="text/css" href="nav.css" />
<meta http-equiv="content-type" content="text/html;  charset=utf-8" />
<title>Mescladors | Caracterització dels sistemes i senyals de telecomunicacions </title>
<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
<meta name="author" content="Gabriel Ramírez" />
<meta name="generator" content="eXeLearning 2.0.4 - exelearning.net" />
<!--[if lt IE 9]><script type="text/javascript" src="exe_html5.js"></script><![endif]-->
<script type="text/javascript" src="exe_jquery.js"></script>
<script type="text/javascript">$exe_i18n={show:"Mostra",hide:"Amaga",showFeedback:"Mostra realimentació",hideFeedback:"Amaga realimentació",correct:"Correcte",incorrect:"Incorrecte",menu:"Menú"}</script>
<script type="text/javascript" src="common.js"></script>
</head>
<body class="exe-web-site"><script type="text/javascript">document.body.className+=" js"</script>
<div id="content">
<p id="skipNav"><a href="#main" class="sr-av">Omet navegació</a></p>
<header id="header" >Caracterització dels sistemes i senyals de telecomunicacions</header>
<nav id="siteNav">
<ul>
   <li><a href="index.html" class="daddy main-node">Caracterització dels sistemes i senyals de telecomunicacions</a></li>
   <li><a href="introducci_a_les_telecomunicacions.html" class="no-ch">Introducció a les telecomunicacions</a></li>
   <li><a href="el_canal_de_comunicacions.html" class="no-ch">El canal de comunicacions.</a></li>
   <li><a href="arquitectura_dels_sistemes_de_comunicacions.html" class="no-ch">Arquitectura dels Sistemes de Comunicacions</a></li>
   <li><a href="senyals_indesitjables.html" class="no-ch">Senyals Indesitjables</a></li>
   <li><a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="no-ch">Classificació dels Sistemes de Telecomunicacions</a></li>
   <li><a href="limitacions_en_la_comunicaci_elctrica.html" class="no-ch">Limitacions en la comunicació elèctrica</a></li>
   <li><a href="la_relaci_senyal_a_soroll.html" class="no-ch">La relació senyal a soroll.</a></li>
   <li><a href="magnitudes_logaritmicas.html" class="no-ch">Magnitudes Logarítmicas</a></li>
   <li><a href="els_bits.html" class="no-ch">Els Bits</a></li>
   <li><a href="digitalitzaci_de_senyals.html" class="no-ch">Digitalització de senyals</a></li>
   <li><a href="amplificadors.html" class="no-ch">Amplificadors</a></li>
   <li><a href="oscilladors.html" class="no-ch">Oscil·ladors</a></li>
   <li id="active"><a href="mescladors.html" class="active no-ch">Mescladors</a></li>
   <li><a href="acopladores_de_impedancia.html" class="no-ch">Acopladores de Impedancia</a></li>
   <li><a href="modulacions.html" class="no-ch">Modulacions</a></li>
   <li><a href="anlisi_de_circuits.html" class="no-ch">Anàlisi de Circuits</a></li>
</ul>
</nav>
<div id='topPagination'>
<nav class="pagination noprt">
<a href="oscilladors.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="acopladores_de_impedancia.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
<div id="main-wrapper">
<section id="main">
<header id="nodeDecoration"><h1 id="nodeTitle">Mescladors</h1></header>
<article class="iDevice_wrapper FreeTextIdevice" id="id130">
<div class="iDevice emphasis0">
<div id="ta130_1" class="block iDevice_content">
<h1 style="text-align: justify;">Mescladors</h1>
<p style="text-align: justify;">Els mescladors, igual que els amplificadors i oscil&middot;ladors, constitueixen elements indispensables dels sistemes de comunicacions. S'utilitzen tant en&nbsp;transmissors com a receptors, quan &eacute;s necessari traslladar els senyals en bandes d'&oacute;na base a una de banda de pas (modulaci&oacute;) o d'una banda de pas a una altra banda de pas (conversi&oacute;). Un mesclador &eacute;s un dispositiu no lineal, al qual s'apliquen dues senyals d'entrada, d'amples de banda diferents, i produeix una senyal de sortida de un altre ample de banda, generalment en dues bandes o m&eacute;s, una d'igual a la suma i altra a la difer&egrave;ncia dels amples de banda dels senyals d'entrada. Aix&ograve; &eacute;s cert a mitges i valgut nom&eacute;s si a la sortida del mesclador s'utilitzen filtres adequats, ja que un mesclador produeix en general, un nombre de senyals de sortida que es designen com espuris, que cal eliminar.</p>
<p style="text-align: justify;">Un concepte important en aquest tema, &eacute;s que no&nbsp;s'ha de confondre un mesclador amb un sumari&nbsp;dor. Aquest &uacute;ltim, &eacute;s un dispositiu lineal que&nbsp;pot considerar com un combinador de&nbsp;senyals, b&eacute; sigui en pot&egrave;ncia o en voltatge, per&ograve;&nbsp;mantenint l'espectre de cadascuna de les&nbsp;senyals sumades. El mesclador &eacute;s un dispositiu&nbsp;tiu no lineal que trasllada i modifica l'espectre&nbsp;de les senyals barrejades, per&ograve; no les suma, les&nbsp;multiplica en el domini del temps. Aix&ograve; &eacute;s&nbsp;alguna cosa, conceptualment molt important i sovint solen barrejar-se o amb-fondre aquests conceptes. El s&iacute;mbol habitual del mesclador es mostra a la figura seg&uuml;ent<span style="font-size: 0.75em; line-height: 1.5;">.</span></p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-08-26_a_les_13.24.54.png" /></p>
<p style="text-align: center;">S&iacute;mbol del mesclador</p>
<p style="text-align: justify;">Un mesclador t&eacute; dos ports d'entrada i un de sortida. En una de les entrades s'aplica, en general, el senyal d'un oscil &middot; lador local i en l'altra, el senyal que es vol traslladar en l'espectre de freq&uuml;&egrave;ncia i que pot ser o b&eacute; una senyal en banda base o una senyal modulada de radiofreq&uuml;&egrave;ncia. Una manera simple d'interpretar el comportament d'un mesclador &eacute;s com un multiplicador, en qu&egrave; el senyal de sortida &eacute;s el producte de les dues senyals d'entrada. Els mescladors s'empren per traslladar senyals en una banda de l'espectre a una altra banda. Si el senyal d'entrada &eacute;s una senyal en banda base, el mesclador &eacute;s, essencialment, el modulador. Encara que els mescladors s&oacute;n igualment importants en els transmissors i en els receptors, la terminologia tradicionalment utilitzada es refereix mes als receptors, ja que va ser en aquests equips en qu&egrave; es van comen&ccedil;ar a utilitzar extensament en els inicis de la r&agrave;dio, amb la invenci&oacute; del receptor superheterod&iacute;. Aix&iacute; a la senyal modulada d'entrada se li designa com RF i l'altra senyal d'entrada, de freq&uuml;&egrave;ncia fixa, utilitzada per traslladar l'espectre de freq&uuml;&egrave;ncia de la senyal de RF a una altra&nbsp;banda, se la designa com a portadora local i &eacute;s generada per un oscil&middot;lador local (LO o OL). La sortida del mesclador es designa com a freq&uuml;&egrave;ncia interm&egrave;dia (FI). Si la FI de sortida &eacute;s inferior a la de RF d'entrada, es diu que el mesclador realitza una conversi&oacute; descendent, en cas contrari, la conversi&oacute; &eacute;s ascendent. El terme convertidor o conversor s'utilitza per designar un circuit que cont&eacute; al mesclador i al oscil&middot;lador local.</p>
<p style="text-align: justify;">Tots els mescladors s&oacute;n multiplicadors, en el sentit que el senyal de sortida que produeixen es pot descriure matem&agrave;ticament com el producte de les senyals d'entrada. No obstant aix&ograve;, des del punt de vista d'implementaci&oacute;, un mesclador donat pot caracteritzar-se com additiu o multiplicatiu, depenent de la forma en qu&egrave; se li apliquin les senyals de RF i OL. La barreja additiva passa quan les senyals de RF i OL s'apliquen en s&egrave;rie al mateix port d'entrada. En realitat, aquesta barreja additiva passa despr&eacute;s per un dispositiu no lineal, com un d&iacute;ode, que produeix una resposta multiplicativa. La barreja directament multiplicativa passa quan les senyals de RF i OL s'apliquen a ports separats.</p>
<h2 style="text-align: justify;">Teoria b&agrave;sica dels mescladors</h2>
<p style="text-align: justify;">Els mescladors s&oacute;n dispositius no lineals, les caracter&iacute;stiques del qual poden ser diferents, depenent dels dispositius particulars empleats. Independentment d'aix&ograve;, la caracter&iacute;stica de transfer&egrave;ncia d'un mesclador pot expressar com:</p>
<p style="text-align: justify;"><img src="Captura_de_pantalla_2013-09-01_a_les_13.19.52.png" /></p>
<p style="text-align: justify;">On l'exponent, n, no &eacute;s necess&agrave;riament sencer. V pot ser un voltatge de c.c. o pot ser zero. K es el factor d'atenuaci&oacute; o guany. I els voltatges de senyal v1 i v2 en el cas mes simple poden expressar-se com:</p>
<p style="text-align: justify;"><img src="Captura_de_pantalla_2013-09-01_a_les_13.20.39.png" /></p>
<p style="text-align: justify;">On V es l'amplitud del senyal, i <span>&omega;</span>&nbsp;la frequ&egrave;ncia. Sent v1 i v2 senyals sinuidals.</p>
<p style="text-align: justify;">Si n = 1, el dispositiu &eacute;s lineal i &eacute;s un sumador, no un mesclador i, a la sortida, com es mostra a la figura seg&uuml;ent, s&oacute;n presents les dues senyals d'entrada sumades o superposades, sense altres components espectrals m&eacute;s que les originals.</p>
<p style="text-align: center;"><img src="Captura_de_pantalla_2013-09-01_a_les_13.21.43.png" width="603" height="193" /></p>
<p style="text-align: center;">Sortida en el domini del temps d'un sumador (n=1)</p>
<p style="text-align: justify;"><br />Per al cas en qu&egrave; n = 2, tenim:</p>
<p style="text-align: justify;"><img src="Captura_de_pantalla_2013-09-01_a_les_13.31.27.png" /><br />Aquesta senyal de sortida seria la que s'obtindria amb un dispositiu de caracter&iacute;stica quadr&agrave;tica com un d&iacute;ode. Un valor diferent de n donaria com a resultat la generaci&oacute; d'altres productes de barreja, per&ograve; aix&ograve; &eacute;s suficient per comprendre el proc&eacute;s.</p>
<p style="text-align: justify;">La sortida inclou un termini de corrent continu i un cert nombre de components espectrals, de les quals en aquest cas, no s&oacute;n d'inter&egrave;s ni la component de cc ni les que nom&eacute;s contenen les freq&uuml;&egrave;ncies &omega;1 o &omega;2, ja presents a l'entrada. Ignorant aquests termes a la sortida i assumint, sense p&egrave;rdua de generalitat que el voltatge V de cc &eacute;s zero, la sortida a freq&uuml;&egrave;ncia interm&egrave;dia aquesta donada per:</p>
<p style="text-align: justify;"><img src="Captura_de_pantalla_2013-09-01_a_les_13.32.33.png" /></p>
<p style="text-align: justify;">La seg&uuml;ent figura ilustra el resultat de la funci&oacute; anterior. Hi tenim dos senyals d'entrada a freq&uuml;&egrave;ncies&nbsp;<span>&omega;</span><span>1 i&nbsp;<span>&omega;2</span></span>&nbsp;amb amplituds V1 i V2 respectivament. A la sortida tenim, tal i com indica la funci&oacute; de dalt les freq&uuml;&egrave;ncies&nbsp;&omega;1+&omega;2 i&nbsp;&omega;1-&omega;2 centrades al voltant de la major de les dues i amb una amplitud [kV1V2 / 2]</p>
<p><img src="Captura_de_pantalla_2013-09-01_a_les_13.34.54.png" style="display: block; margin-left: auto; margin-right: auto;" /></p>
<p style="text-align: center;"><span>Sortida en el domini del temps d'un mesclador (n=2)</span></p>
<p style="text-align: justify;">A la figura s'il&middot;lustra la funci&oacute; del mesclador en el domini del temps. El circuit &eacute;s molt similar al del sumador, excepte per l'element no lineal, en aquest cas un d&iacute;ode. La senyal en el punt d'uni&oacute; de les dues resist&egrave;ncies d'entrada &eacute;s la mateixa que t&eacute; a la sortida del sumador, &eacute;s a dir, la suma de les dues senyals. No obstant aix&ograve; al passar pel d&iacute;ode, les dues senyals d'entrada de fet es multipliquen, de manera que el senyal de sortida no cont&eacute; components espectrals a les freq&uuml;&egrave;ncies de les senyals d'entrada. Les components espectrals de la senyal&nbsp;de sortida s&oacute;n les de suma i difer&egrave;ncia de les freq&uuml;&egrave;ncies d'entrada.</p>
<p style="text-align: justify;">Si les senyals d'entrada s&oacute;n de la mateixa freq&uuml;&egrave;ncia i difereixen nom&eacute;s en l'angle de fase, &phi;, la sortida del mesclador &eacute;s 1/2 kV1V2 cos&phi;. Un circuit d'aquest tipus, en qu&egrave; les senyals d'entrada s&oacute;n de la mateixa freq&uuml;&egrave;ncia, per&ograve; de fase diferent, es designa com a <strong>detector de fase</strong> i la seva sortida, filtrada a baixa freq&uuml;&egrave;ncia, &eacute;s una senyal de corrent continu, variable i proporcional a la difer&egrave;ncia de fase entre les senyals d'entrada.</p>
<p style="text-align: justify;">En general nom&eacute;s una de les bandes laterals, o un parell simetric d'elles &eacute;s desitjable a la sortida i cal eliminar les senyals esp&uacute;ries restants, pel que a la sortida del mesclador sol connectar-se un filtre de pas de banda que nom&eacute;s deixa passar la o les senyals a les freq&uuml;&egrave;ncies desitjades i elimina les restants.</p>
<p style="text-align: justify;">En el cas m&eacute;s general, les senyals d'entrada al mesclador s&oacute;n de freq&uuml;&egrave;ncia diferent. Usualment una de les senyals d'entrada &eacute;s una senyal modulada, amb un cert ample de banda i l'altra, de freq&uuml;&egrave;ncia fixa. Si el mesclador &eacute;s ideal, el senyal&nbsp;de sortida estar&agrave; formada per dues bandes, una a la freq&uuml;&egrave;ncia de suma de les dues senyals d'entrada i una altra, a la freq&uuml;&egrave;ncia de difer&egrave;ncia. En la pr&agrave;ctica cap mesclador &eacute;s ideal i produeixen espuris d'ordres superiors. De totes les freq&uuml;&egrave;ncies a la sortida del mesclador, nom&eacute;s les contingudes en una determinada banda de pas s&oacute;n les desitjables. Les senyals en aquesta banda es poden recuperar mitjan&ccedil;ant un filtre de pas de banda a la sortida del mesclador que elimini totes les senyals fora d'aquesta banda. No obstant aix&ograve;, pot oc&oacute;rrer i sovint passa, que alguns dels productes espuris d'intermodulaci&oacute; cauen dins de la banda de pas desitjada i no poden eliminar-se amb el filtrat. La pres&egrave;ncia d'aquests productes d'intermodulaci&oacute; en la banda de pas degrada inevitablement la senyal. Quan aquests espuris dins de la banda es deuen al propi mesclador, cal triar una freq&uuml;&egrave;ncia del oscil&middot;lador local i de sortida del mesclador, tals que en la mesura possible tots els espuris quedin fora de la banda de pas.</p>
<p style="text-align: justify;">En els circuits de comunicacions la intermodulaci&oacute; no es produeix nom&eacute;s en el mesclador. Tamb&eacute; &eacute;s causada per no linealitats en altres circuits, particularment en amplificadors de pot&egrave;ncia que funcionen parcialment en zones no lineals de la seva caracter&iacute;stica i que, combinats amb els espuris del mesclador solen donar lloc a productes d'intermodulaci&oacute; dins de la banda de pas. En realitat, qualsevol dispositiu amb una caracter&iacute;stica no lineal de transfer&egrave;ncia pot actuar com a mesclador i s'han donat casos d'antenes que, constru&iuml;des amb metalls diferents i connexions defectuoses, produeixen distorsi&oacute; no lineal i actuen com d&iacute;odes mescladors.<br />La senyal de sortida de qualsevol mesclador real inclou un gran nombre de senyals indesitjables, els productes d'intermodulaci&oacute;, que contenen senyals a les freq&uuml;&egrave;ncies fonamentals del oscil&middot;lador local i de la senyal de RF i els seus harm&ograve;nics. Aix&ograve; produeix distorsi&oacute; per intermodulaci&oacute; entre les m&uacute;ltiples senyals, que pot comprometre el correcte funcionament del sistema.</p>
<p style="text-align: justify;">Des del punt de vista de la seva implementaci&oacute;, es pot parlar de tres tipus principals de mezcladors:</p>
<ul>
<li style="text-align: justify;">Mescladors passius: Utilitzen d&iacute;odes com a dispositius de mescla.</li>
<li style="text-align: justify;">Mescladors actius: utilitzen dispositius amb guany, com transistors bipolars o d'efecte de camp.</li>
<li style="text-align: justify;">Mescladors commutats: en qu&egrave; l'amplitud de la senyal del oscil&middot;lador local o b&eacute; &eacute;s molt m&eacute;s gran que la requerida pel mesclador o &eacute;s una senyal polsant, rectangular, de manera que els dispositius del mesclador funcionen essencialment entre un estat de conducci&oacute; i un de no-conducci&oacute;.</li>
</ul>
</div>
</div>
</article>
</section>
</div>
<div id='bottomPagination'>
<nav class="pagination noprt">
<a href="oscilladors.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="acopladores_de_impedancia.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
</div>
</body></html>