<!doctype html>
<html lang="ca">
<head>
<link rel="stylesheet" type="text/css" href="base.css" />
<link rel="stylesheet" type="text/css" href="content.css" />
<link rel="stylesheet" type="text/css" href="nav.css" />
<meta http-equiv="content-type" content="text/html;  charset=utf-8" />
<title>Senyals Indesitjables | Caracterització dels sistemes i senyals de telecomunicacions </title>
<link rel="shortcut icon" href="favicon.ico" type="image/x-icon" />
<meta name="author" content="Gabriel Ramírez" />
<meta name="generator" content="eXeLearning 2.0.4 - exelearning.net" />
<!--[if lt IE 9]><script type="text/javascript" src="exe_html5.js"></script><![endif]-->
<script type="text/javascript" src="exe_jquery.js"></script>
<script type="text/javascript">$exe_i18n={show:"Mostra",hide:"Amaga",showFeedback:"Mostra realimentació",hideFeedback:"Amaga realimentació",correct:"Correcte",incorrect:"Incorrecte",menu:"Menú"}</script>
<script type="text/javascript" src="common.js"></script>
</head>
<body class="exe-web-site"><script type="text/javascript">document.body.className+=" js"</script>
<div id="content">
<p id="skipNav"><a href="#main" class="sr-av">Omet navegació</a></p>
<header id="header" >Caracterització dels sistemes i senyals de telecomunicacions</header>
<nav id="siteNav">
<ul>
   <li><a href="index.html" class="daddy main-node">Caracterització dels sistemes i senyals de telecomunicacions</a></li>
   <li><a href="introducci_a_les_telecomunicacions.html" class="no-ch">Introducció a les telecomunicacions</a></li>
   <li><a href="el_canal_de_comunicacions.html" class="no-ch">El canal de comunicacions.</a></li>
   <li><a href="arquitectura_dels_sistemes_de_comunicacions.html" class="no-ch">Arquitectura dels Sistemes de Comunicacions</a></li>
   <li id="active"><a href="senyals_indesitjables.html" class="active no-ch">Senyals Indesitjables</a></li>
   <li><a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="no-ch">Classificació dels Sistemes de Telecomunicacions</a></li>
   <li><a href="limitacions_en_la_comunicaci_elctrica.html" class="no-ch">Limitacions en la comunicació elèctrica</a></li>
   <li><a href="la_relaci_senyal_a_soroll.html" class="no-ch">La relació senyal a soroll.</a></li>
   <li><a href="magnitudes_logaritmicas.html" class="no-ch">Magnitudes Logarítmicas</a></li>
   <li><a href="els_bits.html" class="no-ch">Els Bits</a></li>
   <li><a href="digitalitzaci_de_senyals.html" class="no-ch">Digitalització de senyals</a></li>
   <li><a href="amplificadors.html" class="no-ch">Amplificadors</a></li>
   <li><a href="oscilladors.html" class="no-ch">Oscil·ladors</a></li>
   <li><a href="mescladors.html" class="no-ch">Mescladors</a></li>
   <li><a href="acopladores_de_impedancia.html" class="no-ch">Acopladores de Impedancia</a></li>
   <li><a href="modulacions.html" class="no-ch">Modulacions</a></li>
   <li><a href="anlisi_de_circuits.html" class="no-ch">Anàlisi de Circuits</a></li>
</ul>
</nav>
<div id='topPagination'>
<nav class="pagination noprt">
<a href="arquitectura_dels_sistemes_de_comunicacions.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
<div id="main-wrapper">
<section id="main">
<header id="nodeDecoration"><h1 id="nodeTitle">Senyals Indesitjables</h1></header>
<article class="iDevice_wrapper FreeTextIdevice" id="id107">
<div class="iDevice emphasis0">
<div id="ta107_1" class="block iDevice_content">
<p style="text-align: justify;">En els sistemes de comunicacions es poden produir efectes que deteriorin la comunicaci&oacute;, en altres paraules, que donin lloc a que la senyal rebuda no sigui tan "neta" com la transmesa. Entre aquests efectes hi ha el soroll, la distorsi&oacute; i les interfer&egrave;ncies.</p>
<h2 style="text-align: justify;">Soroll</h2>
<p style="text-align: justify;">En qualsevol sistema de comunicacions, es produeixen fluctuacions de corrent alienes a les senyals que suporta el sistema. Aquestes fluctuacions s&oacute;n de tipus aleatori i poden tenir diversos or&iacute;gens, al agregar-se a la senyal, deterioren la qualitat de la comunicaci&oacute;. Aquesta situaci&oacute; algunes vegades pot evitar-se o reduir-se i en altres &eacute;s inevitable, de manera que en dissenyar un sistema de comunicacions &eacute;s imprescindible tenir en compte els efectes del soroll de manera que resultin m&iacute;nims. Un tipus de soroll que est&agrave; present sempre en tots els circuits el&egrave;ctrics &eacute;s el <strong>soroll t&egrave;rmic</strong>, a causa de l'agitaci&oacute; electr&ograve;nica en els conductors i semiconductors com a conseq&uuml;&egrave;ncia de la temperatura, es tracta, per tant d'un soroll d'origen natural. Altres fonts naturals de soroll s&oacute;n, per exemple, el mateix univers que ens envolta, el sol, alguns estels, etc. Aquest soroll es designa com a <strong>soroll c&ograve;smic</strong> i &eacute;s important en els sistemes radioel&egrave;ctrics de comunicacions, ja que &eacute;s captat per les antenes receptores juntament amb el senyal. L'atmosfera tamb&eacute; &eacute;s font de soroll el&egrave;ctric, especialment els raigs. Aquest tipus de soroll es denomina <strong>soroll atmosf&egrave;ric</strong>.</p>
<p style="text-align: justify;">Altres fonts de soroll s&oacute;n d'origen hum&agrave;. Entre elles es troben els <strong>motors el&egrave;ctrics</strong> en qu&egrave; es produeixen petites espurnes entre les escombretes i el col&middot;lector, les espurnes actuen com petites antenes transmissores i l'energia emesa &eacute;s captada tamb&eacute; per les antenes dels receptors. El mateix passa amb els <strong>motors de combusti&oacute;</strong> interna a gasolina, en qu&egrave; les bugies tamb&eacute; produeixen espurnes. En zones industrials i urbanes els nivells de soroll d'origen hum&agrave; poden ser molt elevats.</p>
<p style="text-align: justify;">En general, no &eacute;s possible eliminar el soroll t&egrave;rmic, si b&eacute; algunes t&egrave;cniques de processament digital de senyals permet, en alguns casos, reduir considerablement. Els sorolls d'origen hum&agrave; tamb&eacute; s&oacute;n dif&iacute;cils d'eliminar, encara que algunes mesures poden reduir el seu efecte, per exemple <strong>blindant o apantallant els circuits</strong> i utilitzant alguns tipus d'antenes altament direccionals. El <strong>filtratge</strong> no sol tenir efecte mes que en alguns casos, ja que el soroll, i en particular el t&egrave;rmic, t&eacute; components espectrals a tots les freq&uuml;&egrave;ncies, de manera que si s'utilitzen filtres per deixar passar nom&eacute;s la banda d'una senyal, inevitablement en aquesta banda tamb&eacute; hi haur&agrave; soroll i l'&uacute;nic que s'elimin&eacute;s ser&agrave; el soroll fora de la banda d'inter&egrave;s.</p>
<h2 style="text-align: justify;">Distorsi&oacute;</h2>
<p style="text-align: justify;">Per distorsi&oacute; s'ent&eacute;n l'<strong>alteraci&oacute;</strong>, no desitjada, <strong>de la forma d'ona</strong> d'una senyal. Aix&ograve; passa en qualsevol circuit on la resposta en freq&uuml;&egrave;ncia no sigui plana, &eacute;s a dir, que no deixi passar la mateixa manera tots els components Espectrals d'una senyal. Per exemple, un amplificador de so en qu&egrave; les freq&uuml;&egrave;ncies superiors a, diguem, 5 KHz, s'amplifiquen a la meitat del valor que les freq&uuml;&egrave;ncies inferiors a aquest valor. L'amplificador pot resultar adequat per a la veu humana en qu&egrave; &eacute;s suficient un ample de banda de l'ordre de 4 KHz, per&ograve; no ser&agrave; satisfactori per amplificar musica en que l'ample de banda requerit &eacute;s de l'ordre de 12 a 15 KHz. En aquest cas, el so d'alguns instruments perdr&agrave; la seva tonalitat, com a conseq&uuml;&egrave;ncia de l'amplificaci&oacute; desigual dels components freq&uuml;encials del so d'aquests instruments. Aquesta amplificaci&oacute; desigual dels components freq&uuml;encials d'una senyal d&oacute;na com a lloc una alteraci&oacute; de les seves caracter&iacute;stiques espectrals originals i per tant, a distorsi&oacute;. En un circuit, la distorsi&oacute; pot ser el resultat del funcionament d'alguns dispositius del circuit en regions no lineals de les seves caracter&iacute;stiques, que d&oacute;na lloc a una forma de distorsi&oacute; d'interes particular en els sistemes de comunicacions, designada com distorsi&oacute; per intermodulaci&oacute;.</p>
<h2 style="text-align: justify;">Interfer&egrave;ncia</h2>
<p style="text-align: justify;">Per interfer&egrave;ncia s'ent&eacute;n la pres&egrave;ncia de <strong>senyals indesitjables</strong> en un sistema de comunicacions determinat, originades per altres sistemes de comunicacions. En sistemes radioel&egrave;ctrics, aix&ograve; passa quan en una mateixa zona es reben simult&agrave;niament senyals de dos o m&eacute;s sistemes que funcionen a la mateixa banda de freq&uuml;&egrave;ncia, o quan un dels sistemes produeix senyals indesitjables des fora de la seva banda de treball i les freq&uuml;&egrave;ncies cauen dins de la banda d'un altre sistema. En els sistemes de cable les interfer&egrave;ncies s&oacute;n causades per les inducci&oacute; del camp electromagn&egrave;tic produ&iuml;t per la senyal en un cable i que abasten l'espai ocupat per un altre cable. En telefonia ocorren formes d'interfer&egrave;ncia d'aquest tipus que reben el nom de diafonia o de modulaci&oacute; creuada.</p>
</div>
</div>
</article>
<article class="iDevice_wrapper activityIdevice em_iDevice" id="id108">
<div class="iDevice emphasis1" >
<header class="iDevice_header"><h1 class="iDeviceTitle">Activitat 2: Senyals Indesitjables</h1></header>
<div class="iDevice_inner">
<div class="iDevice_content_wrapper">
<div id="ta108_96_2" class="block iDevice_content">
<p>Posa tres exeples d'afectacions de senyals per soroll, distorsió i interferències.</p>
</div>
</div>
</div>
</div>
</article>
</section>
</div>
<div id='bottomPagination'>
<nav class="pagination noprt">
<a href="arquitectura_dels_sistemes_de_comunicacions.html" class="prev"><span>&laquo; </span>Anterior</a> | <a href="classificaci_dels_sistemes_de_telecomunicacions.html" class="next"> Següent<span> &raquo;</span></a>
</nav>
</div>
</div>
</body></html>